monkeyin92/memoria/firmware/esp32/overlay/files/main/boards/memoria/esp-vocat/memoria_esp_vocat.cc
class MemoriaEspVocat;

class Charge : public I2cDevice {
public:
    static constexpr uint8_t kRegVoltage = 0x08;
    static constexpr uint8_t kRegBatteryStatus = 0x0A;
    static constexpr uint8_t kRegCurrent = 0x0C;
    static constexpr uint8_t kRegStateOfCharge = 0x2C;
    static constexpr uint8_t kRegAverageCurrent = 0x14;
    static constexpr int kChargingCurrentMa = 30;
    static constexpr uint16_t kBatteryStatusDsg = BIT0;

    Charge(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr) {
        read_buffer_ = new uint8_t[8];
    }
    ~Charge() { delete[] read_buffer_; }

    int16_t ReadWord(uint8_t reg) {
        uint8_t data[2] = {0};
        ReadRegs(reg, data, 2);
        return static_cast<int16_t>(static_cast<uint16_t>(data[0]) |
                                    (static_cast<uint16_t>(data[1]) << 8));
    }

    int GetBatteryLevel() {
        int level = ReadWord(kRegStateOfCharge);
        if (level < 0) {
            return 0;
        }
        if (level > 100) {
            return 100;
        }
        return level;
    }

    bool IsCharging() {
        const uint16_t status = static_cast<uint16_t>(ReadWord(kRegBatteryStatus));
        if ((status & kBatteryStatusDsg) == 0) {
            return true;
        }

        const int16_t avg_current_ma = ReadWord(kRegAverageCurrent);
        const int16_t current_ma = ReadWord(kRegCurrent);
        return avg_current_ma > kChargingCurrentMa || current_ma > kChargingCurrentMa;
    }

    bool IsDischarging() {
        return (static_cast<uint16_t>(ReadWord(kRegBatteryStatus)) & kBatteryStatusDsg) != 0;
    }

    void Update() {
        const int16_t voltage = ReadWord(kRegVoltage);
        const int16_t current = ReadWord(kRegCurrent);
        ESP_ERROR_CHECK(temperature_sensor_get_celsius(temp_sensor, &tsens_value));
        (void)voltage;
        (void)current;
    }

private:
    uint8_t* read_buffer_ = nullptr;
};

class Cst816s : public I2cDevice {
public:
    struct TouchPoint_t {
        int num = 0;
        int x = -1;
        int y = -1;
    };

    enum TouchEvent { TOUCH_NONE, TOUCH_PRESS, TOUCH_RELEASE, TOUCH_HOLD };

    Cst816s(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr) {
        read_buffer_ = new uint8_t[6];
        was_touched_ = false;
        press_count_ = 0;

        touch_isr_mux_ = xSemaphoreCreateBinary();
        if (touch_isr_mux_ == NULL) {
            ESP_LOGE(TAG, "Failed to create touch semaphore");
        }
    }

    ~Cst816s() {
        delete[] read_buffer_;

        if (touch_isr_mux_ != NULL) {
            vSemaphoreDelete(touch_isr_mux_);
            touch_isr_mux_ = NULL;
        }
    }

    void UpdateTouchPoint() {
        uint8_t reg = 0x02;
        esp_err_t err = i2c_master_transmit_receive(i2c_device_, &reg, 1, read_buffer_, 6, 100);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "CST816S read failed: %s", esp_err_to_name(err));
            tp_.num = 0;
            tp_.x = -1;
            tp_.y = -1;
            return;
        }
        tp_.num = read_buffer_[0] & 0x0F;
        tp_.x = ((read_buffer_[1] & 0x0F) << 8) | read_buffer_[2];
        tp_.y = ((read_buffer_[3] & 0x0F) << 8) | read_buffer_[4];
    }

    const TouchPoint_t& GetTouchPoint() { return tp_; }

    TouchEvent CheckTouchEvent() {
        bool is_touched = (tp_.num > 0);
        TouchEvent event = TOUCH_NONE;

        if (is_touched && !was_touched_) {
            press_count_++;
            event = TOUCH_PRESS;
            ESP_LOGI(TAG, "TOUCH PRESS - count: %d, x: %d, y: %d", press_count_, tp_.x, tp_.y);
        } else if (!is_touched && was_touched_) {
            event = TOUCH_RELEASE;
            ESP_LOGI(TAG, "TOUCH RELEASE - total presses: %d", press_count_);
        } else if (is_touched && was_touched_) {
            event = TOUCH_HOLD;
            ESP_LOGD(TAG, "TOUCH HOLD - x: %d, y: %d", tp_.x, tp_.y);
        }

        was_touched_ = is_touched;
        return event;
    }

    int GetPressCount() const { return press_count_; }

    void ResetPressCount() { press_count_ = 0; }

    SemaphoreHandle_t GetTouchSemaphore() { return touch_isr_mux_; }

    bool WaitForTouchEvent(TickType_t timeout = portMAX_DELAY) {
        if (touch_isr_mux_ != NULL) {
            return xSemaphoreTake(touch_isr_mux_, timeout) == pdTRUE;
        }
        return false;
    }

    void NotifyTouchEvent() {
        if (touch_isr_mux_ != NULL) {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            xSemaphoreGiveFromISR(touch_isr_mux_, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }
    }

private:
    uint8_t* read_buffer_ = nullptr;
    TouchPoint_t tp_;

    bool was_touched_;
    int press_count_;

    SemaphoreHandle_t touch_isr_mux_;
};

class MemoriaEspVocat : public WifiBoard {
private:
    // The ES7210 microphone array gain is configured to 36 dB (+6 dB from 30 dB)
    // to ensure normal 30-60 cm speech maintains healthy RMS above the gateway
    // noise floor and improves far-field wake word detection.
    // Strict local AFE VAD keeps room noise below the gateway noise-gate floor.
    static constexpr float kMicInputGainDb = 36.0f;

    i2c_master_bus_handle_t i2c_bus_;
    i2c_bus_handle_t shared_i2c_bus_handle_ = nullptr;
    Cst816s* cst816s_;
    Charge* charge_;
    Button boot_button_;
    MemoriaMascotDisplay* display_ = nullptr;
    PwmBacklight* backlight_ = nullptr;
    esp_timer_handle_t touchpad_timer_;
    TaskHandle_t charge_task_handle_ = nullptr;
    TaskHandle_t touch_task_handle_ = nullptr;
    TaskHandle_t imu_task_handle_ = nullptr;
#if ESP_VOCAT_ENABLE_CAP_TOUCH_SENSOR
    TaskHandle_t touch_slider_task_handle_ = nullptr;
    touch_slider_handle_t touch_slider_handle_ = nullptr;
    touch_button_handle_t touch_button_handle_ = nullptr;
#endif
    bool bmi270_ready_ = false;
    bool was_charging_ = false;
    std::atomic<int64_t> imu_mute_until_ms_{0};

    static void battery_task(void* arg) {
        auto* self = static_cast<MemoriaEspVocat*>(arg);
        while (true) {
            if (self != nullptr && self->charge_ != nullptr) {
                self->charge_->Update();
                bool is_charging = self->charge_->IsCharging();
                if (is_charging != self->was_charging_) {
                    self->was_charging_ = is_charging;
                    ESP_LOGI(TAG, "Charging state changed: %s", is_charging ? "CHARGING" : "DISCHARGING");
                }
            }
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }

    // BMI270 has no haptic motor. A body tap is a short accel impulse, not
    // conversation start, screen tap rumble, or a sustained shake. The pulse
    // classifier lives in memoria_pat.h so host tests can feed IMU sequences.
    // Both gestures only animate the companion locally; neither starts a chat.
    static constexpr int64_t kTouchImuMuteMs = 400;

    void OnDevicePat(int score) {
        auto& app = Application::GetInstance();
        const auto state = app.GetDeviceState();
        ESP_LOGI(TAG, "Device pat detected (score: %d) state=%d", score,
                 static_cast<int>(state));
        if (state != kDeviceStateIdle || display_ == nullptr) {
            return;
        }
        display_->Pat();  // a happy hop
    }

