monkeyin92/memoria/firmware/esp32/overlay/files/main/boards/memoria/esp-vocat/memoria_esp_vocat.cc
    void OnDeviceShake(int score) {
        const auto state = Application::GetInstance().GetDeviceState();
        ESP_LOGI(TAG, "Device shake (score: %d): dizzy companion, no chat", score);
        if (state != kDeviceStateIdle || display_ == nullptr) {
            return;
        }
        display_->Shake();
    }

    static void imu_event_task(void* arg) {
        auto* self = static_cast<MemoriaEspVocat*>(arg);
        if (self == nullptr) {
            vTaskDelete(NULL);
            return;
        }

        memoria::PatDetector detector;
        struct bmi2_sens_data prev = {};
        bool has_prev = false;

        while (true) {
            struct bmi2_sens_data cur = {};
            if (!Bmi270Motion::ReadAccelRaw(cur)) {
                detector.Reset();
                has_prev = false;
                vTaskDelay(pdMS_TO_TICKS(20));
                continue;
            }
            if (has_prev) {
                int dx = abs(static_cast<int>(cur.acc.x) - static_cast<int>(prev.acc.x));
                int dy = abs(static_cast<int>(cur.acc.y) - static_cast<int>(prev.acc.y));
                int dz = abs(static_cast<int>(cur.acc.z) - static_cast<int>(prev.acc.z));
                int score = dx + dy + dz;
                int64_t now_ms = esp_timer_get_time() / 1000;
                const bool muted =
                    now_ms < self->imu_mute_until_ms_.load(std::memory_order_relaxed);
                const auto result = detector.Observe(score, muted, now_ms);
                if (result.kind == memoria::PatKind::kPat) {
                    self->OnDevicePat(result.peak);
                } else if (result.kind == memoria::PatKind::kShake) {
                    self->OnDeviceShake(result.peak);
                } else if (result.kind == memoria::PatKind::kTouchRumble) {
                    ESP_LOGI(TAG, "Device pat ignored (touch rumble, score: %d)",
                             result.peak);
                }
            }
            prev = cur;
            has_prev = true;
            vTaskDelay(pdMS_TO_TICKS(20));
        }
    }

    void MuteImuForTouch() {
        imu_mute_until_ms_.store((esp_timer_get_time() / 1000) + kTouchImuMuteMs,
                                 std::memory_order_relaxed);
    }

    void HandleScreenTouchRelease() {
        MuteImuForTouch();
        auto& app = Application::GetInstance();
        const auto state = app.GetDeviceState();
        if (state == kDeviceStateStarting) {
            EnterWifiConfigMode();
            return;
        }
        if (state == kDeviceStateSpeaking) {
            app.AbortSpeaking(kAbortReasonNone);
            return;
        }
        if (state == kDeviceStateRecovering) {
            app.ToggleChatState();
            return;
        }
        if (state == kDeviceStateListening) {
            app.StopListening();
            return;
        }
        if (state == kDeviceStateIdle || state == kDeviceStateConnecting) {
            ESP_LOGI(TAG, "idle screen tap ignored; wake word or BOOT starts chat");
            return;
        }
        ESP_LOGI(TAG, "screen tap ignored in state=%d", static_cast<int>(state));
    }

    void InitializeI2c() {
        i2c_config_t i2c_cfg = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .sda_pullup_en = true,
            .scl_pullup_en = true,
            .master =
                {
                    .clk_speed = 400000,
                },
            .clk_flags = 0,
        };
        shared_i2c_bus_handle_ = i2c_bus_create(I2C_NUM_0, &i2c_cfg);
        if (!shared_i2c_bus_handle_) {
            ESP_LOGE(TAG, "Failed to create shared I2C bus");
            ESP_ERROR_CHECK(ESP_FAIL);
        }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0) && !CONFIG_I2C_BUS_BACKWARD_CONFIG
        i2c_bus_ = i2c_bus_get_internal_bus_handle(shared_i2c_bus_handle_);
#else
#error "ESP-VoCat board requires i2c_bus_get_internal_bus_handle() support"
#endif
        if (!i2c_bus_) {
            ESP_LOGE(TAG, "Failed to get I2C master handle");
            ESP_ERROR_CHECK(ESP_FAIL);
        }

        temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
        ESP_ERROR_CHECK(temperature_sensor_install(&temp_sensor_config, &temp_sensor));
        ESP_ERROR_CHECK(temperature_sensor_enable(temp_sensor));
    }

    uint8_t DetectPcbVersion() {
        gpio_config_t gpio_conf = {.pin_bit_mask = (1ULL << CORDEC_POWER_CTRL),
                                   .mode = GPIO_MODE_OUTPUT,
                                   .pull_up_en = GPIO_PULLUP_DISABLE,
                                   .pull_down_en = GPIO_PULLDOWN_DISABLE,
                                   .intr_type = GPIO_INTR_DISABLE};
        ESP_ERROR_CHECK(gpio_config(&gpio_conf));
        ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 0));
        vTaskDelay(pdMS_TO_TICKS(50));

        bool codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
        uint8_t pcb_version = 0;
        if (codec_alive) {
            ESP_LOGI(TAG, "PCB version V1.0");
            pcb_version = 0;
        } else {
            ESP_ERROR_CHECK(gpio_set_level(CORDEC_POWER_CTRL, 1));
            vTaskDelay(pdMS_TO_TICKS(50));
            codec_alive = (i2c_master_probe(i2c_bus_, 0x18, 100) == ESP_OK);
            if (codec_alive) {
                ESP_LOGI(TAG, "PCB version V1.2");
                pcb_version = 1;
                AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                TOUCH_PAD2 = TOUCH_PAD2_2;
                UART1_TX = UART1_TX_2;
                UART1_RX = UART1_RX_2;
            } else {
                ESP_LOGE(TAG, "PCB version detection error");
            }
        }
        return pcb_version;
    }

    static void touch_isr_callback(void* arg) {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad != nullptr) {
            touchpad->NotifyTouchEvent();
        }
    }

    static void touch_event_task(void* arg) {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad == nullptr) {
            ESP_LOGE(TAG, "Invalid touchpad pointer in touch_event_task");
            vTaskDelete(NULL);
            return;
        }

        while (true) {
            if (touchpad->WaitForTouchEvent()) {
                touchpad->UpdateTouchPoint();
                auto touch_event = touchpad->CheckTouchEvent();
                auto& board = static_cast<MemoriaEspVocat&>(Board::GetInstance());
                if (touch_event == Cst816s::TOUCH_PRESS ||
                    touch_event == Cst816s::TOUCH_HOLD) {
                    board.MuteImuForTouch();
                }
                if (touch_event == Cst816s::TOUCH_RELEASE) {
                    board.HandleScreenTouchRelease();
                }
            }
        }
    }

    void InitializeCharge() {
        charge_ = new Charge(i2c_bus_, 0x55);
        was_charging_ = charge_->IsCharging();
        xTaskCreatePinnedToCore(battery_task, "batteryTask", 3 * 1024, this, 6,
                                &charge_task_handle_, 0);
    }

