monkeyin92/memoria/firmware/esp32/overlay/files/main/boards/memoria/esp-vocat/memoria_esp_vocat.cc
    void InitializeButtons() {
        boot_button_.OnClick([this]() {
            auto& app = Application::GetInstance();
            const auto state = app.GetDeviceState();

            if (state == kDeviceStateStarting) {
                EnterWifiConfigMode();
            } else if (state == kDeviceStateSpeaking) {
                app.AbortSpeaking(kAbortReasonNone);
            } else if (state == kDeviceStateRecovering) {
                // The physical stop remains authoritative while the transport
                // is down; ToggleChatState terminally cancels recovery.
                app.ToggleChatState();
            } else if (state == kDeviceStateListening) {
                app.StopListening();
            } else if (state == kDeviceStateWifiConfiguring) {
                GetDisplay()->ShowNotification("WiFi 配网中", 1500);
            } else {
                app.ToggleChatState();
            }
        });

        boot_button_.OnLongPress([this]() {
            const auto state = Application::GetInstance().GetDeviceState();
            if (state == kDeviceStateWifiConfiguring) {
                // Bring the binding QR (nearby Wi-Fi provisioning) back.
                Application::GetInstance().Schedule([this]() {
                    if (memoria::MemoriaBootstrap::GetInstance().Start(display_) != ESP_OK) {
                        GetDisplay()->ShowNotification("WiFi 配网中", 1500);
                    }
                });
                return;
            }
            if (state == kDeviceStateRecovering) {
                auto& app = Application::GetInstance();
                app.ToggleChatState();
                app.Schedule([this]() { EnterWifiConfigMode(); });
                return;
            }
            if (state == kDeviceStateStarting || state == kDeviceStateIdle) {
                Settings runtime("memoria_runtime", true);
                if (state == kDeviceStateIdle || runtime.GetInt("activation_v", 0) == 0) {
                    Application::GetInstance().Schedule([this]() {
                        if (memoria::MemoriaBootstrap::GetInstance().Start(display_) == ESP_OK) {
                            return;
                        }
                        GetDisplay()->ShowNotification("正在进入配网", 1500);
                        EnterWifiConfigMode();
                    });
                    return;
                }
            }
            GetDisplay()->ShowNotification("正在进入配网", 1500);
            EnterWifiConfigMode();
        });

        gpio_config_t power_gpio_config = {
            .pin_bit_mask = (BIT64(POWER_CTRL)),
            .mode = GPIO_MODE_OUTPUT,
            .pull_up_en = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_ERROR_CHECK(gpio_config(&power_gpio_config));
        gpio_set_level(POWER_CTRL, 0);
    }

public:
    ~MemoriaEspVocat() {
        if (charge_task_handle_ != nullptr) {
            vTaskDelete(charge_task_handle_);
        }
        if (touch_task_handle_ != nullptr) {
            vTaskDelete(touch_task_handle_);
        }
        if (imu_task_handle_ != nullptr) {
            vTaskDelete(imu_task_handle_);
        }
#if ESP_VOCAT_ENABLE_CAP_TOUCH_SENSOR
        if (touch_slider_task_handle_ != nullptr) {
            vTaskDelete(touch_slider_task_handle_);
            touch_slider_task_handle_ = nullptr;
        }
        if (touch_slider_handle_ != nullptr) {
            touch_slider_sensor_delete(touch_slider_handle_);
            touch_slider_handle_ = nullptr;
        }
        if (touch_button_handle_ != nullptr) {
            touch_button_sensor_delete(touch_button_handle_);
            touch_button_handle_ = nullptr;
        }
#endif

        delete charge_;
        delete cst816s_;
        delete display_;

        gpio_isr_handler_remove(TP_PIN_NUM_INT);

        if (temp_sensor != NULL) {
            temperature_sensor_disable(temp_sensor);
            temperature_sensor_uninstall(temp_sensor);
            temp_sensor = NULL;
        }
    }

    MemoriaEspVocat() : boot_button_(BOOT_BUTTON_GPIO) {
        InitializeI2c();
        uint8_t pcb_version = DetectPcbVersion();
        InitializeCharge();
        InitializeBmi270();

        InitializeSpi();
        InitializeSt77916Display(pcb_version);
        InitializeCst816sTouchPad();
        InitializeButtons();
#if ESP_VOCAT_ENABLE_CAP_TOUCH_SENSOR
        InitializeCapacitiveTouchPads();
#endif
    }

    virtual AudioCodec* GetAudioCodec() override {
        static BoxAudioCodec audio_codec(
            i2c_bus_, AUDIO_INPUT_SAMPLE_RATE, AUDIO_OUTPUT_SAMPLE_RATE, AUDIO_I2S_GPIO_MCLK,
            AUDIO_I2S_GPIO_BCLK, AUDIO_I2S_GPIO_WS, AUDIO_I2S_GPIO_DOUT, AUDIO_I2S_GPIO_DIN,
            AUDIO_CODEC_PA_PIN, AUDIO_CODEC_ES8311_ADDR, AUDIO_CODEC_ES7210_ADDR,
            AUDIO_INPUT_REFERENCE, kMicInputGainDb);
        return &audio_codec;
    }

    virtual Display* GetDisplay() override { return display_; }

    Cst816s* GetTouchpad() { return cst816s_; }

    virtual Backlight* GetBacklight() override { return backlight_; }

    virtual bool GetBatteryLevel(int& level, bool& charging, bool& discharging) override {
        if (charge_ == nullptr) {
            return false;
        }
        level = charge_->GetBatteryLevel();
        charging = charge_->IsCharging();
        discharging = charge_->IsDischarging();
        return true;
    }
};

DECLARE_BOARD(MemoriaEspVocat);
